# ========== IMPORTING FILES ===============

In [12]:
import pandas as pd

# importing a file to read as a DataFrame
more_results = pd.read_excel('more_results.xlsx')
more_results

  student  Test1  Test2  Test3
0     joe     55     70     70
1   klara     45     60     75
2     ian     75     70     80
3    lisa     65     55     65
4     ava     70     65     75

 ### ==== Running basic checks on the data ====

In [13]:
#head()
#This is to view first 5 records in a dataset
more_results.head()

  student  Test1  Test2  Test3
0     joe     55     70     70
1   klara     45     60     75
2     ian     75     70     80
3    lisa     65     55     65
4     ava     70     65     75

In [14]:
#tail()
#This is to view the last results of how many you enter into the parenthesis
more_results.tail(2)

  student  Test1  Test2  Test3
3    lisa     65     55     65
4     ava     70     65     75

### ==== Shape ====

In [15]:
# Here you get the size of the dataframe. This has 3 rows and 5 columns. Note the index column is not included
more_results.shape

(5, 4)

### ==== Info ====

In [16]:
# To get summary of the dataframe
more_results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   student  5 non-null      object
 1   Test1    5 non-null      int64
 2   Test2    5 non-null      int64
 3   Test3    5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

### ==== iloc() and loc() ====

In [17]:
#df.iloc[rows, columns]

In [18]:
# iloc is used to retrieve rows and columns by index position
more_results.iloc[0:1, 0:2]

  student  Test1
0     joe     55

In [19]:
# does not work with text - uncomment and run to show error
#more_results.iloc[0:1, 'student': 'test2']

In [21]:
#loc() - to retrieve rows and columns by label
more_results.loc[0:0, 'student' : 'Test1']

  student  Test1
0     joe     55

In [22]:
# Another example with loc
more_results.loc[0:2, 'student' : 'Test1']

  student  Test1
0     joe     55
1   klara     45
2     ian     75

In [23]:
more_results.describe()

           Test1      Test2      Test3
count   5.000000   5.000000   5.000000
mean   62.000000  64.000000  73.000000
std    12.041595   6.519202   5.700877
min    45.000000  55.000000  65.000000
25%    55.000000  60.000000  70.000000
50%    65.000000  65.000000  75.000000
75%    70.000000  70.000000  75.000000
max    75.000000  70.000000  80.000000

In [27]:
# set_option()
# set precision
#pd.set_option('precision', 1)
more_results.describe().round(1)

       Test1  Test2  Test3
count    5.0    5.0    5.0
mean    62.0   64.0   73.0
std     12.0    6.5    5.7
min     45.0   55.0   65.0
25%     55.0   60.0   70.0
50%     65.0   65.0   75.0
75%     70.0   70.0   75.0
max     75.0   70.0   80.0